#include <dispcolor.h>
#include <font.h>
#include <stdio.h>
#include <stdlib.h>
#include <stdarg.h>
#include <string.h>
#include <st77xx.h>
#include <st7735.h>

//==============================================================================
// Процедура инициализирует цветной дисплей
//==============================================================================
void disp_Init(uint8_t Width, uint8_t Height)
{
  // Инициализация дисплея
  ST7735_Init(Width, Height);
}
//==============================================================================


//==============================================================================
// Процедура устанавливает яркость дисплея
//==============================================================================
void disp_SetBrightness(uint8_t Value)
{
  st77xx_SetBL(Value);
}
//==============================================================================


//==============================================================================
// Процедура закрашивает экран цветом color
//==============================================================================
void disp_FillScreen(uint16_t color)
{
  ST77xx_FillScreen(color);
}
//==============================================================================


//==============================================================================
// Процедура окрашивает 1 пиксель дисплея
//==============================================================================
void disp_DrawPixel(int16_t x, int16_t y, uint16_t color)
{
  ST77xx_DrawPixel(x, y, color);
}
//==============================================================================


//==============================================================================
// Процедура заполнения прямоугольника цветом color
//==============================================================================
void disp_FillRect(int16_t x, int16_t y, int16_t w, int16_t h, uint16_t color)
{
  ST77xx_FillRect(x, y, w, h, color);
}
//==============================================================================


//==============================================================================
// Процедура заполнения прямоугольной области из буфера (порядок заполнения сектора Y, X
//==============================================================================
void disp_DrawPartYX(int16_t x, int16_t y, int16_t w, int16_t h, uint16_t *pBuff)
{
  ST77xx_DrawPartYX(x, y, w, h, pBuff);
}
//==============================================================================


//==============================================================================
// Процедура заполнения прямоугольной области из буфера (порядок заполнения сектора X, Y
//==============================================================================
void disp_DrawPartXY(int16_t x, int16_t y, int16_t w, int16_t h, uint16_t *pBuff)
{
  ST77xx_DrawPartXY(x, y, w, h, pBuff);
}
//==============================================================================
